#define _CRT_SECURE_NO_WARNINGS  // ДКЪ ПЮАНРШ Я ЯХ (РНКЭЙН Б v/s)
#include <stdio.h>
#include <locale.h>  // ЙХПХККХЖЮ

/* 1. тсмйжхъ пейспяхбмни йнмбепрюжхх деяърхвмнцн вхякю б дбнхвмне
	  пейспемрмне яннрмньемхе:
	  декхрэ вхякн я нярюрйнл мю 2, онйю ме асдер днярхцмср 0 - сякнбхе бшундю хг пейспяхх
	  опх вермнл декемхх дбнхвмши нярюрнй пюбем 0, ю опх мевермнл декемхх дбнхвмши нярюрнй пюбем 1 */
void DecDub(int num) {
	if (num > 0) {   // БШУНД ХГ ПЕЙСПЯХХ
		DecDub(num / 2);  // ПЕЙСПЯХЪ 
	}
	printf("%d", num % 2);  // 010010011
}
//=============================================================================================================
/* 2. тсмйжхъ пейспяхбмнцн бнгбедемхъ вхякю б яреоемэ
	  пейспемрмне яннрмньемхе:
	  слмнфюрэ вхякн яюлн мю яеаъ, йюфдши пюг слемэьюъ яреоемэ мю 1 */
int LogNum(int num, int degree) {  // ВХЯКН, ЯРЕОЕМЭ
	if (degree > 0) {  // БШУНД ХГ ПЕЙЙСПЯХХ
		return LogNum(num, degree - 1) * num;  // ПЕЙСПЯХЪ
	}

	else {
		return 1;
	}
}
//=============================================================================================================
/* 3. тсмйжхъ пейспяхбмнцн бнгбедемхъ вхякю б яреоемэ, хяонкэгсъ ябниярбн вермнярх яреоемх
	  пейспемрмне яннрмньемхе:
	  еякх яреоемэ вермюъ: x^n = (x^2)^n/2 (ВХЯКН^2; ЯРЕОЕМЭ / 2)
				 мевермюъ: x^n = (x^2)^n-1 (ВХЯКН^2; ЯРЕОЕМЭ - 1 ) */
int PropDeg(int num, int degree) {

	if (degree > 0) {  // БШУНД ХГ ПЕЙЙСПЯХХ
		if (degree % 2 == 0) {  // ВЕРМЮЪ
			return LogNum(num * num, degree / 2);  // ПЕЙСПЯХЪ
		}

		else {  // МЕВЕРМЮЪ
			return LogNum(num * num, degree - 1);  // ПЕЙСПЯХЪ
		}
	}

	else {
		return 1;
	}
}
//=============================================================================================================
/* 4. ондявер йнкхвеярбю бнглнфмшу люпьпсрнб йнпнкъ хг кебнцн-бепумецн сцкю онкъ, б опюбши-мхфмхи, я опеоърярбхълх (1 - опеоърярбхе, 0 - ябнандмюъ йкерйю)
	  пейспемрмне яннрмньемхе:
	  -нопедекхрэ нрйсдю лнфмн оноюярэ б опюбсч-мхфмчч йкерйс (йнмевмсч), нярюкэмше якнфмше пюяверш опнцпюллю ядекюер яюлю:
	  б опюбсч-мхфмчч йкерйс (йнмевмсч) лнфмн оноюярэ хг дбсу яняедмху - мюд йнмевмни(У,С-1) х якебю нр йнмевмни (У-1,С)

	  -б ябнч нвепедэ осреи дкъ оноюдюмхъ б щрх дбе йкерйх - щрн яняедмхе я мхлх йкерйх = 4 х р.д., онйю ме онидел дн оепбни ярпнйх х оепбнцн ярнкажю онкъ (р.й. б йкерйх оепбни ярпнйх (0,y) - мекэгъ оноюярэ хг йкерйх ябепус, ю б йкерйх оепбнцн ярнкажю (x,0) - хг ъвеийх якебю)

	  -р.е. йюфдши пюг опнхяундхр якнфемхе йнкхвхярбю осреи, бедсыху б нвепедмсч йкерйс (x,y - нЯХ йннпдхмюр)  // ЙНКХВЕЯРБН ЛЮПЬПСРНБ S(x,y) = S(У,С-1) + S(У-1,С)
	  йнкхвеярбн люпьпсрнб б йнмевмсч йкерйс = йнкхвеярбн люпьпсрнб б ндмс яняедмчч йкерйс + йнкхвеярбн люпьпсрнб б дпсцсч яняедмчч йкерйс

	  еякх ндмю хг йннпдхмюр бшвхякъелни йкерйх "У" хкх "С" == 0                                              // ЙНКХВЕЯРБН ЛЮПЬПСРНБ S(x,y) = 1

	  еякх х "У" х "С" == 0 (ярюпрнбше йннпдхмюрш)                                                            // ЙНКХВЕЯРБН ЛЮПЬПСРНБ S(x,y) = 0 */
int routes(int x, int y, int coordX, int coordY) {  // ОПХМХЛЮЕЛ ЙННПДХМЮРШ ЙКЕРЙХ, ДКЪ ЙНРНПНИ АСДЕЛ ЯВХРЮРЭ ЙНКХВЕЯРБН ЛЮПЬПСРНБ

	if (x == 0 && y == 0) {  // "У" Х "С" ПЮБЕМ 0
		return 0;
	}

	else if (x == 0 || y == 0) {  // "У" ХКХ "С" ПЮБЕМ 0
		return 1;
	}

	else {  // ЕЯКХ Х "У" Х "С" > 0

		if (x == coordX && y == coordY) {

		}
		// бшвхякемхе йнкхвеярбю люпьпсрнб б нопедекеммсч йкерйс
		return routes(x, y - 1, coordX, coordY) + routes(x - 1, y, coordX, coordY);  // ПЕЙСПЯХЪ - ЙНКХВЕЯРБН БНГЛНФМШУ ЛЮПЬПСРНБ Б НОПЕДЕКЕММСЧ ЙКЕРЙС = ЯСЛЛЕ ЛЮПЬПСРНБ, БЕДСЫХУ Б ОПЕДШДСЫХЕ ЙКЕРЙХ
	}
}

int main() {
	setlocale(LC_ALL, "Rus");  // ЙХПХККХЖЮ

	// 1.
	DecDub(147);  // !!!МЕ ОНИЛС ЙЮЙ ГЮЯРЮБХРЭ ОПНВХРЮРЭ РНКЭЙН ОНЯКЕДМХЕ 8 ЖХТП, БЛЕЯРН БЯЕУ 9-РХ Х ОНЯРЮБХРЭ ЮОНЯРПЮТ?
	printf("\n");
	//=============================================================================================================
	// 2.
	printf("%d ", LogNum(2, 6));
	printf("\n");
	//=============================================================================================================
	// 3.
	int num, degree;  // ВХЯКН, ЯРЕОЕМЭ

	printf("Enter the num please: ");
	scanf("%d", &num);

	printf("Enter the degree please: ");
	scanf("%d", &degree);

	printf("%d ", PropDeg(num, degree));
	printf("\n");
	//=============================================================================================================
	// 4.
	// онке 8У8
	const sizeX = 8;
	const sizeY = 8;

	int coordXForCros;  // ЙННПДХМЮРЮ ОПХОЪРЯРБХЪ ОН "У"
	int coordYForCros;  // ЙННПДХМЮРЮ ОПХОЪРЯРБХЪ ОН "y"

	printf("бБЕДХРЕ ЙННПДХМЮРС ОПХОЪРЯРБХЪ ОН \"У\": ");
	scanf("%d", &coordXForCros);

	printf("бБЕДХРЕ ЙННПДХМЮРС ОПХОЪРЯРБХЪ ОН \"С\": ");
	scanf("%d", &coordYForCros);
	printf("\n");

	// бшбнд б бхде рюакхжш
	for (int y = 0; y < sizeY; y++) {
		for (int x = 0; x < sizeX; x++) {
			printf("%5d", routes(x, y, coordXForCros, coordYForCros));  /*  */
		}
		printf("\n");
	}

	return 0;
}