
/*==================================================================================================================
1
==================================================================================================================== */

short int rool = - 10;

int a = 30'000;

long long b = 9'223'372'036'854'077;

char c = '14';  // ♫

bool d;
d = true;

float e;
e = -2'147'483'647.9f;

double f;
f =  9 223 372 036 854 775 805.9999999999;




/*==================================================================================================================
2
==================================================================================================================== */

// объявление и инициализация перечисления "Cell", типа "enum", с перечислением состояний ячейки поля
enum Cell : char  {
	CROSS = 'X',
	ZERRO = '0',   
	EMPTY = 0
	};
	
	
	
	
/*==================================================================================================================
3
==================================================================================================================== */

enum Cell : char  {
	CROSS = 'X',
	ZERRO = '0',   
	EMPTY = 0
	};
	
int main() {
// объявление и инициализация двумерного массива для игрового поля "field", состоящего из трех массивов, изночально каждый из которых содержит по три пустых элемента "Cell"(ячейки)		
		Cell field[3][3] { { EMPTY, EMPTY, EMPTY }, { EMPTY, EMPTY, EMPTY }, { EMPTY, EMPTY, EMPTY } };

	return 0;
}




/*==================================================================================================================
4*
==================================================================================================================== */

// объявление и инициализация перечисления "Cell", типа "enum", с перечислением состояний ячейки поля
enum Cell : char  {
	CROSS = 'X',
	ZERRO = '0',   
	EMPTY = 0
	};

// объявляем новую структуру "Tic_Tac_ToeField"(поле для игры)
struct Tic_Tac_ToeField {
	Cell field[3][3] { { EMPTY, EMPTY, EMPTY }, { EMPTY, EMPTY, EMPTY }, { EMPTY, EMPTY, EMPTY } };  // массив игрового поля, состоящий из трех массивов, изночально каждый из которых содержит по три пустых элемента "Cell"(ячейки)
	char player1_name[];                // символьный массив "имя первого игрока"
	char player2_name[];                // символьный массив "имя второго игрока"
	char first_player_play_with;        // символьная переменная "чем играет первый игрок"
	char first_second_play_with;        // символьная переменная "чем играет второй игрок"
	bool game_over;                     // логическая переменная "игра закончилась или нет"
	bool the_first_player_won;          // логическая переменная "победил первый игрок"
	bool the_second _player_won;        // логическая переменная "победил второй игрок"
	bool draw;                          // логическая переменная "ничья"
	bool play_with_the_computer         // логическая переменная "играть с компьютером"
	unsigned short complexity;          // положительная, короткая переменная "сложность игры с компьтером"
	unsigned short player_id;           // положительная, короткая переменная id игрока 
	
	
};




/*==================================================================================================================
5**
==================================================================================================================== */

union MyData {                // объявление универсальной переменной "MyData", типа "union"
	
	int a;
	float b;                  // объявление беззнаковых переменных
    char c;	
};

struct MyBoolean            // объявление структуры "MyBoolean"
{ 
 unsigned int Flag1 : 1;     // битовый флаг 1
 unsigned int Flag2 : 1;     // битовый флаг 2
 unsigned int Flag3 : 1;     // битовый флаг 3

struct MyVariant {
	MyData;
}

int main() {
	
	MyData m;           // объявление новой переменной "m", типа "MyData"   
	
	m.b = 333.555f;     // инициализация переменной "m" и присваивание ей типа "float"
	 
	m.с = a ;           // инициализация переменной "m" и присваивание ей типа "char"
	
	m.a = 14'990;       // инициализация переменной "m" и присваивание ей типа "int"

    return 0;
}
