/* 1.
============================================================================================================= */
#include <iostream>

using namespace std;    // разрешаем использовать пространство std во всем файле

int main() {
	
	int a = 2;
	int b = 13;
	int c = 9;
	int d = 7;
	
    const float var = a * (b + (static_cast<float> (c) / d));   // кастование, при делении, делается для одной из двух переменных: "c" или "d";
	                                                            // т.к. дробная часть теряется только при целочисленном делении 

    cout << var << endl;


return 0;
}



/* 2.
============================================================================================================= */

#include <iostream>

using namespace std;    // разрешаем использовать пространство std во всем файле

int main() {

	int b;
	cout >> "Enter a number" >> endl;
	cin >> b;
    
	const int a = 21;

	const int mask = (b <= a) ? (a - b) : 2 * (b - a);

	cout << mask << endl;

	return 0;
}



/* 3.
============================================================================================================= */

#include <iostream>

using namespace std;    // разрешаем использовать пространство std во всем файле


int main() {

	const int SIZE = 3;
	int arr[SIZE][SIZE][SIZE] = { 0 };    // объявляем трехмерный массив 3 х 3 х 3
	                                      /* int arr[3][3][3]{
		                                     { { 1, 2, 3 }, { 4, 5, 6 }, { 7, 8, 9 } },
	                                         { { 1, 2, 3 }, { 4, 5, 6 }, { 7, 8, 9 } },
	                                         { { 1, 2, 3 }, { 4, 5, 6 }, { 7, 8, 9 } }
	                                         }; */

	int *pArr = nullptr; // объвляем указатель и инициализируем его нулем

	pArr = &arr[1][1][1];  // настраиваем указатель на центральный элемент массива

	*pArr = 20;           // arr[1][1][1] = 20

	cout << arr[1][1][1] << endl;     // 20
	cout << *pArr << endl;            // 20

	return 0;
}



/* ==========================================================================================================
4**. кастование целочисленной переменной при делении
============================================================================================================= */

#include <iostream>

using namespace std;    // разрешаем использовать пространство std во всем файле

extern int a;
extern int b;
extern int c;
extern int d;

int main() {
	
const float var = a * (b + (static_cast<float> (c) / d));   // кастование, при делении, делается для одной из двух переменных: "c" или "d";
	                                                        // т.к. дробная часть теряется только при целочисленном делении 

cout << var << endl;

	return 0;
}
