/* 1.
============================================================================================================= */
#include <iostream>

using namespace std;    // разрешаем использовать пространство std во всем файле

int main() {
	
	int a = 2;
	int b = 13;
	int c = 9;
	int d = 7;
	
<<<<<<< HEAD
    const float var = a * (b + (static_cast<float> (c) / d));  // кастование, при делении, делается для одной из двух переменных: "c" или "d";
	                                                           // т.к. дробная часть теряется только при целочисленном делении 

    cout << "a * (b + (c / d)) = " << var << endl;
=======
        float e = static_cast <float> (c) / d;
        float f = b + static_cast <float> (e);
        float g = a * static_cast <float> (f);
	
	cout << "a * (b + (c / d)) = " << g << endl;
>>>>>>> 05a99834e9c7c4d1e38c655921509282ed434478


return 0;
}



/* 2.
============================================================================================================= */

#include <iostream>

using namespace std;    // разрешаем использовать пространство std во всем файле

int main() {

	int b;
	cout >> "Enter a number" >> endl;
	cin >> b;
    
	const int a = 21;

	const int mask = (b <= a) ? (a - b) : 2 * (b - a);

	cout << mask << endl;

	return 0;
}



/* 3.
============================================================================================================= */

#include <iostream>

using namespace std;    // разрешаем использовать пространство std во всем файле


int main() {

<<<<<<< HEAD
	const int SIZE = 3;
	int arr[SIZE][SIZE][SIZE] = { 0 };    // объявляем трехмерный массив 3 х 3 х 3
	                                      /* int arr[3][3][3]{
		                                     { { 1, 2, 3 }, { 4, 5, 6 }, { 7, 8, 9 } },
	                                         { { 1, 2, 3 }, { 4, 5, 6 }, { 7, 8, 9 } },
	                                         { { 1, 2, 3 }, { 4, 5, 6 }, { 7, 8, 9 } }
	                                         }; */

	int *pArr = nullptr; // объвляем указатель и инициализируем его нулем
=======
	int arr[3][3][3] = {
        { { 1, 2, 3 }, { 1, 2, 3 }, { 3, 4, 5 } },
	{ { 1, 2, 3 }, { 1, 11, 3 }, { 3, 4, 5 } },
	{ { 1, 2, 3 }, { 1, 2, 3 }, { 3, 4, 5 } }
	};
	
	int* pArr = nullptr; // объвляем указатель и инициализируем его нулем
>>>>>>> 05a99834e9c7c4d1e38c655921509282ed434478

	pArr = &arr[1][1][1];  // настраиваем указатель на центральный элемент массива

	*pArr = 20;           // arr[1][1][1] = 20

	cout << arr[1][1][1] << endl;     // 20
	cout << *pArr << endl;            // 20

	return 0;
}



/* ==========================================================================================================
4**. кастование целочисленной переменной при делении
============================================================================================================= */

#include <iostream>

using namespace std;    // разрешаем использовать пространство std во всем файле

extern int a;
extern int b;
extern int c;
extern int d;

int main() {
	
<<<<<<< HEAD
    const float var = a * (b + (static_cast<float> (c) / d));

    cout << "a * (b + (c / d)) = " << var << endl;
=======
    float e = static_cast <float> (c) / d;
    float f = b + static_cast <float> (e);
    float g = a * static_cast <float> (f);

    cout << "a * (b + (c / d)) = " << g << endl;
>>>>>>> 05a99834e9c7c4d1e38c655921509282ed434478

	return 0;
}
