/* ==========================================================================================================
1. ФУНКЦИЯ ВЫВОДА МАССИВА, КОТОРЫЙ ОБЪЯВЛЕН В ДРУГОЙ ФУНКЦИИ
============================================================================================================= */
	
#include <iostream>
using namespace std;

int fun(const double* arr, const size_t SIZE)  /* 4. - вызываем - int fun, в которую будем принимать указатель на массив и его размер
															  делаем эти параметры константами, т.к. ничего менятся не будет */
{
    return 0;
}

int main()
{
	const size_t SIZE = 10;  // 1. - создание константы размера для будущего массива
	double arr[SIZE] = { 1.654, 2.545, 4.334, 6.656, 7.343, 8.870, 2.645 };  // 2. - создание массива типа double
	fun(arr, SIZE);  // 3. - вызываем fun из main

	for (size_t i = 0; i < SIZE; i++)  // 5. - цикл выводящий элементы массива от 0; до 9; 9 + 1 = 10 - последнее число
	{
		cout << arr[i] << " ";  // 6. - вывод элеменов массива по одному из предыдущего шага ↑ ↑ ↑
	}
	cout << endl;

	return 0;
}



/* ==========================================================================================================
2. ФУНКЦИЯ ЗАМЕНЫ ВСЕХ ЭЛЕМЕНТОВ МАССИВА, КОТОРЫЙ ОБЪЯВЛЕН В ДРУГОЙ ФУНКЦИИ
============================================================================================================= */
	
#include <iostream>
using namespace std;

int fun(int* arr, size_t SIZE)  // 4. - вызываем - int fun, в которую будем принимать указатель на массив и его размер
{

	for (size_t i = 0; i < SIZE; i++)  // 5. - цикл выводящий элементы массива от 0; до 9; 9 + 1 = 10 - последнее число
	{
		cout << arr[i] << " ";  
	}
	cout << endl;

	for (size_t i = 0; i < SIZE; i++)  // 6. - цикл выводящий измененный массив
	{
		if (arr[i] == 1)
		{
			arr[i] = 0;
		}

		else if (arr[i] == 0)
		{
			arr[i] = 1;
		}

		cout << arr[i] << " ";
	}

	return 0;
}

int main()
{
	const size_t SIZE = 10;  // 1. - создание константы размера для будущего массива
	int arr[SIZE] = { 1, 1, 0, 0, 1, 0, 1, 1, 0, 0 };  // 2. - создание массива
	fun(arr, SIZE);  // 3. - вызываем fun из main

	return 0;
}
	
	
	
/* ==========================================================================================================
3. ФУНКЦИЯ ЗАПОЛНЕНИЯ МАССИВА, КОТОРЫЙ ОБЪЯВЛЕН В ДРУГОЙ ФУНКЦИИ ПРИ ПОМОЩИ ЦИКЛА for
============================================================================================================= */

#include <iostream>
using namespace std;

int fun(int* arr, size_t SIZE)
{

	for (size_t i = 1; i <= 22; i += 3)
	{
		cout << i << " ";
	}
	
	return 0;
}


int main()
{
	const size_t SIZE = 8;  
	int arr[SIZE] = { 0 };  
	fun(arr, SIZE);         
	
	
	return 0;
}
	
	
	
/* ==========================================================================================================
4*. ЦИКЛИЧЕСКИЙ СДВИГ ЭЛЕМЕНТОВ МАССИВА С ВЫЗОВОМ ФУНКЦИИ ИЗ main
============================================================================================================= */
	
#include <iostream>
using namespace std;

int fun(int* arr, size_t SIZE, int n)  // 4. - вызываем - int fun, в которую будем принимать указатель на массив, размер и число n
{

	for (size_t i = 0; i < SIZE; i++)  // 5. - цикл выводящий элементы массива
	{
		cout << arr[i] << " ";
	}
	cout << endl;

	for (size_t i = 0; i < SIZE; i++)  // 6. - цикл массива со сдвигом
	{
		if (n < 0)  // при n отрицательном:
		{
	        arr[i] = arr[i - n];
		}

		else if (n > 0)
		{
			arr[i] = arr[i + n];
		}

		else if (n == 0)
			break;

		cout << arr[i] << " ";
	}

	return 0;
}

	
/* ==========================================================================================================
5**. УСЛОВИЕ ПРОВЕРЯЮЩЕЕ РАВЕНСТВО ЛЕВОЙ И ПРАВОЙ ЧАСТЕЙ МАССИВА, С ВЫЗОВОМ ФУНКЦИИ ИЗ main
============================================================================================================= */

#include <iostream>
using namespace std;

bool fun(int* arr, size_t SIZE)  // 4. - объявляем bool fun, в которую будем принимать указатель на массив, размер массива из main
{
	for (size_t i = 0; i < SIZE; i++)  // 5. - цикл выводящий элементы массива
	{
		cout << arr[i] << " ";
	}
	cout << endl;
	
	if (arr[0] + arr[1] == arr[2] + arr[3])
	{
		cout << "The parts of the array are equal!" << endl;
	}
	
	else
	{
		cout << "The parts of the array are NOT equal!" << endl;
	}

	return 0;
}

int main()
{
	const size_t SIZE = 4;  // 1. - создание константы размера для будущего массива
	int arr[SIZE] = { 1, 6, 3, 4 };  // 2. - создание массива
	fun(arr, SIZE);  // 3. - вызываем fun 
	
    return 0;
}