/* ==========================================================================================================
1. ДИНАМИЧЕСКОЕ ВЫДЕЛЕНИЕ ПАМЯТИ И ИНИЦИАЛИЗАЦИЯ ДЛЯ ОДНОМЕРНОГО МАССИВА C ВВОДОМ С КЛАВИАТУРЫ
============================================================================================================= */
	
#include <iostream>

using namespace std;

int fun(int* ptrArr, int n)
{
    const int STEP = 2;
    for (size_t i = 1; i < n; i++)  // 9. - цикл массива
    {
        ptrArr[i] = i * STEP; 

        cout << ptrArr[i] << " ";
    }
    return 0;
}

    int main()
{
    int* ptrArr; // Указатель на массив
    int n; // Количество элементов
    cout << "Enter size of your array: ";
    cin >> n;

    if (n > 0)
    {
        ptrArr = new (std::nothrow) int[n]; // Выделение памяти под одномерный массив

        if (ptrArr != nullptr) // Если память выделена
        {
            fun(ptrArr, n);
            delete[] ptrArr;  // освобождение памяти
        }
        
        else
        {
            cout << "Error! Can not allocate memory!";
        }
    }

    return 0;
}



/* ==========================================================================================================
2. ДИНАМИЧЕСКОЕ ВЫДЕЛЕНИЕ ПАМЯТИ И РАНДОМНАЯ ИНИЦИАЛИЗАЦИЯ ДВУХМЕРНОГО МАССИВА
============================================================================================================= */

#include <iostream>

using namespace std;

int fun(int** pArr, const size_t SIZE)
{
    srand(time(0));
    for (size_t i = 0; i < SIZE; i++)
    {
        pArr[i] = new int[SIZE];  // 1. - настраиваем указатель на элемент массива и выделяем память
        pArr[i][i] = rand();  // СЛИШКОМ СЛОЖНО, НЕ ЗНАЮ КАК ПРАВИЛЬНО...
        cout << pArr[i][i] << " ";
    }

    for (size_t i = 0; i < SIZE; i++)
    {
        delete[] pArr[i];  // 3. - удаляем строки матрицы
    }
    delete[] pArr;
    
    return 0;
}

int main()
{
    size_t SIZE = 4;
    
    int** pArr;

    pArr = new int* [SIZE];

    fun(pArr, SIZE);
            

    return 0;
}

	
	
/* ==========================================================================================================
3. ПРОГРАММА СОЗДАНИЯ ДВУХ ТЕКСТОВЫХ ФАЙЛОВ, С ЗАПРОСОМ ИХ НАЗВАНИЯ У ПОЛЬЗОВАТЕЛЯ
============================================================================================================= */

#include <iostream>
#include <fstream>
using namespace std;

int main()
{
	string file_1, file_2;
	
	cout << "Enter the name file_1:" << endl;  
	cin >> file_1; 
	ofstream fout(file_1);
	fout << "Some content...in file_1" << endl;
	
	cout << "Enter the name file_2:" << endl;
	cin >> file_2;
	ofstream fout(file_2);
    fout << "Some content...in file_2" << endl;

	return 0;

}

	
	
/* ==========================================================================================================
4*. ДЫМ ИЗ УШЕЙ, БОЛЬШЕ НЕ МОГУ...
============================================================================================================= */	


	
/* ==========================================================================================================
5**. 
============================================================================================================= */

