from modul1 import *

# ==================================================================
# Задача 30
# ==================================================================
# Заполните массив элементами арифметической прогрессии.
# Её первый элемент, разность и количество элементов нужно ввести с клавиатуры.
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.
# 7 2 5 -> 7 9 11 13 15

# first = int(input("Введите первое число прогрессии: "))
# d = int(input("Введите шаг прогрессии: "))
# n = int(input("Введите размер прогрессии: "))
# print(fill_arr(first, n, d))


# ==================================================================
# Задача 32
# ==================================================================
# Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)
# [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7] -> [1, 9, 13, 14, 19]
# size = int(input("Введите размер массива: "))
# arr = init_arr(size)
# min = int(input("Введите минимум: "))
# max = int(input("Введите максимум: "))
# print(arr)
# print(between_elements(arr, max, min))
