/*===========================================================================================================
ПРОГРАММА ПРИНИМАЕТ НА ВХОД ПЯТИЗНАЧНОЕ ЧИСЛО И ПРОВЕРЯЕТ, ЯВЛЯЕТСЯ ЛИ ОНО ПАЛИНДРОМОМ
=============================================================================================================*/
#pragma warning disable  // чтобы не выскакивали предупреждения

int n;
Console.WriteLine($"Введите число 10'000..99'999: ");
int.TryParse(Console.ReadLine(), out n);
if (n >= 10000 && n < 100000)
{
    if (n / 10000 == n % 10 && n / 1000 % 10 == n % 100 / 10) Console.Write($"да");
    else Console.Write($"нет");
}
else
    Console.Write("Вы ввели не пятизначное число!");