/*===========================================================================================================
ПРОГРАММА ВЫВОДИТ ТРЕТЬЮ ЦИФРУ ЗАДАННОГО ЧИСЛА ИЛИ СООБЩАЕТ, ЧТО ТРЕТЬЕЙ ЦИФРЫ НЕТ
=============================================================================================================*/
int a = new Random().Next(0, 100000);  // 0..99'999
Console.WriteLine($"{a}");
if(a >= 0 && a < 9){  // 0..9
    Console.WriteLine("третьей цифры нет");
}
else if(a >= 10 && a < 99){  // 10..99
    Console.WriteLine("третьей цифры нет");
}
else if(a >= 100 && a < 999){  // 100..999
    int a3 = a % 10;  // третья цифра
    Console.WriteLine($"{a3}");
}
else if(a >= 1000 && a < 9999){  // 1'000..9'999
    int a3 = a / 10 % 10;  // третья цифра
    Console.WriteLine($"{a3}");
}
else if(a >= 10000 && a < 99999){  // 10'000..99'999
    int a3 = a % 1000 / 100;  // третья цифра
    Console.WriteLine($"{a3}");
}