/*===========================================================================================================
ПРОГРАММА ПРИНИМАЕТ ЧИСЛО n И ВОЗВРАЩАЕТ ТАБЛИЦУ КУБОВ ОТ 1 ДО n
=============================================================================================================*/
#pragma warning disable  // чтобы не выскакивали предупреждения

int n;
int count = 1;
Console.Write($"Введите число: ");
int.TryParse(Console.ReadLine(), out n);
while (count <= n)
{
    Console.Write($"{count * count * count} ");
    count++;
}