/*===========================================================================================================
ПРОГРАММА СОЗДАЕТ ДВУМЕРНЫЙ МАССИВ РАЗМЕРОМ mхn, ЗАПОЛНЕННЫЙ СЛУЧАЙНЫМИ ВЕЩЕСТВЕННЫМИ ЧИСЛАМИ
=============================================================================================================*/
#pragma warning disable

int m = 3;
int n = 4;
double[,] arr = new double[m, n];
for (int i = 0; i < arr.GetLength(0); i++)
{
    for (int j = 0; j < arr.GetLength(1); j++)
    {
        arr[i, j] = new Random().NextDouble() * 20 - 10; // -10..10
        Console.Write($"{Math.Round(arr[i, j], 1),6}");
    }
    Console.WriteLine();
}