/*===========================================================================================================
ПРОГРАММА ВЫЧИСЛЯЕТ ФУНКЦИИ АККЕРМАНА ДЛЯ ДВУХ НЕОТРИЦАТЕЛЬНЫХ ЧИСЕЛ, ЧЕРЕЗ РЕКУРСИЮ
=============================================================================================================*/
#pragma warning disable
int AckermanRec(int m, int n)
{
    if (n >= 0 && m == 0) return n + 1;
    else if (m > 0 && n == 0) return AckermanRec(m - 1, 1);
    else return AckermanRec(m - 1, AckermanRec(m, n - 1));
}
int m = 2;
int n = 4;
if (m >= 0 && n >= 0) Console.Write($"A(m,n) = {AckermanRec(m, n)}");
else Console.Write($"Оба числа должны быть неотрицательными!");